doi_server/LATE3/LATE2/app/views/dois/show.html.erb

SELECT "urls".* FROM "urls"  WHERE "urls"."doi_id" = ?  [["doi_id", 1]]
---
  <tbody>
    <% @doi.urls.each do |url| %>