doi_server/LATE3/app/controllers/dois_controller.rb

  def index
    @dois = Doi.all
---
SELECT "dois".* FROM "dois"

  def create
    @doi = Doi.new(doi_params)

    if @doi.save
---
INSERT INTO "dois" ("created_at", "description", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-27 04:57:15.829756"], ["description", "cnn"], ["name", "news"], ["updated_at", "2014-10-27 04:57:15.829756"], ["url", "www.cnn.com"]]

  def destroy
    @doi.destroy
---
DELETE FROM "dois" WHERE "dois"."id" = ?  [["id", 1]]

    def set_doi
      @doi = Doi.find(params[:id])
---
SELECT  "dois".* FROM "dois"  WHERE "dois"."id" = ? LIMIT 1  [["id", 1]]